<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class articleController extends Controller
{
    public static function index(){
        $news = [
            ['title' => 'बैंकर र व्यवसायी छुट्ट्याउने दिशामा ‘बाफिया’ : एक प्रतिशत सेयर हुनेले ऋण नपाउने', 'description' => '८ चैत, काठमाडौं । सरकारले बैंकर र व्यवसायीलाई अलग्याउने स्पष्ट व्यवस्था सहित ‘बैंक तथा वित्तीय संस्था सम्बन्धी ऐन’ (बाफिया) संशोधन प्रस्ताव संसद्‍मा दर्ता गराएको छ ।
    
            सरकारले दर्ता गरेको बाफिया संशोधनले दफा ५२ मा संशोधन गरी कुनै बैंकमा उल्लेख्य स्वामित्व भएको व्यक्तिलाई कुनै किसिमको कर्जा वा सुविधा प्रदान गरिने छैन भन्ने उल्लेख छ ।
            
            बाफिया संशोधन प्रस्तावमा ‘उल्लेख्य स्वामित्व’ को परिभाषामा पनि संशोधन गरी कुनै बैंक तथा वित्तीय संस्थामा १ प्रतिशत सेयर स्वामित्व भन्ने जनाउने बनाइएको छ ।' , 'id' => 1],
            ['title' => 'सिडिओले मिडियाको निगरानी गर्ने निर्देशनबाट पछि हट्यो गृह मन्त्रालय', 'description' => '८ चैत, काठमाडौं । गृह मन्त्रालयले आमसञ्चारमाध्यमका विषय निगरानी र कारबाही चलाउन प्रमुख जिल्ला अधिकारीहरुलाई गरेको परिपत्र सच्याएको छ ।
    
            ७७ जिल्लाका प्रमुख जिल्ला अधिकारीहरुलाई बिहीबार पठाएको परिपत्रमा अनलाइन तथा छापा सञ्चारमाध्यमको अनुगमन र कारबाही गर्न जिल्ला प्रशासन कार्यालयमा डेस्क राख्ने उल्लेख थियो ।
            
            तर उक्त परिपत्र सार्वजनिक भएसँगै विरोध सुरु भएको थियो । त्यसपछि बिहीबार साँझ नै गृह मन्त्रालयले अर्को विज्ञप्ति जारी गरी सञ्चारमाध्यमको निगरानी र कारबाही गर्ने विषय परिपत्रमा समावेश नभएको स्पष्टीकरण दिएको छ ।' , 'id' => 2],
            ['title' => 'पञ्चायतका अञ्चलाधीश सम्झाउने गृहको परिपत्र', 'description' => '‘अनलाइन न्युजपोर्टल, फेसबुक, ट्वीटरलगायत सामाजिक सञ्जाल र छापा माध्यमबाट अनर्गल, आधारहीन, भ्रामक सन्देशहरू प्रचारप्रसार गर्ने, जातीय सांस्कृतिक सद्भाव भड्काउने, राष्ट्रिय एकता अखण्डता, सार्वभौमिकतामा आँच आउने सामग्री राख्ने, कुनै व्यक्तिको गोपनीयताको हक अतिक्रमण गर्ने, सार्वजनिक प्रतिष्ठा र सम्मानमा नोक्सान पुग्ने गरी अभिव्यक्ति दिने, अश्लीलता प्रवर्द्धन गर्नेजस्ता कार्यहरूको नियन्त्रण गरी दोषीलाई कारबाही गर्न जिल्ला प्रहरी कार्यालय र जिल्ला प्रशासन कार्यालयमा एक-एक जना अधिकृतस्तरको कर्मचारी खटाइ डेस्क सञ्चालन गर्ने । यस प्रकारका कार्यमा संलग्न उपर प्रचलित कानुन बमोजिम कारबाही गरी सार्वजनिकीरण गर्ने ।’ ' , 'id' => 3],
            ['title' => 'भलिबल छाडेर विदेशिंदै उदीयमान खेलाडी रवि', 'description' => '८ चैत, काठमाडौं । पछिल्लो समय उत्कृष्ट प्रदर्शन गर्दै आएका युवा स्पाइकर रवि केसीलाई अब नेपाली दर्शकले कोर्टमा देख्न पाउने छैनन् ।
    
            राष्ट्रिय प्रतियोगिताहरुमा गण्डकी प्रदेशबाट खेल्ने २४ वर्षीय रवि दुई सातापछि जापान जाँदैछन् ।
            
            काठमाडौंमा जारी आठौं एनभीए भलिबल च्याम्पियनसिप अन्तर्गत पुरुषतर्फ उनको टिम गण्डकी प्रदेश सेमिफाइनल पुगेको छ ।
            
            गण्डकीले जितेको तीनै खेलमा कप्तान रवि नै प्लेयर अफ द म्याच चुनिएका थिए । नेपालमा उनको यो अन्तिम प्रतियोगिता हो । कलिलो उमेर, ६ फिट २ इन्च उचाइ र शक्तिशाली स्पाइक रविका विशेषता हुन् ।' , 'id' => 4],
        ];
        return view('welcome', ['news' => $news]);
    }

    public static function news(){
        
    }
}
